{
  "meta": {
    "code": 200,
    "requestId": "5b550e3edb04f50b1ed20ca1"
  },
  "response": {
    "menu": {
      "provider": {
        "name": "singleplatform",
        "attributionImage": "https:\/\/as.singleplatform.com\/Foursquare\/shamshiry\/provided_by.png",
        "attributionLink": "http:\/\/w.singlepage.com\/shamshiry\/menu?ref=Foursquare",
        "attributionText": "Disclaimer: Always check with the business for pricing and availability of menu items. SinglePlatform is not responsible for menu or pricing changes, but the information is believed to be accurate when posted. Listing of a menu does not mean that there is any affiliation, endorsement or sponsorship between SinglePlatform and the listed business."
      },
      "menus": {
        "count": 1,
        "items": [
          {
            "menuId": "mncpeldjjf81c2oqzy99gz9e7",
            "name": "Main Menu",
            "description": "",
            "entries": {
              "count": 6,
              "items": [
                {
                  "sectionId": "s3492951",
                  "name": "Appetizers",
                  "entries": {
                    "count": 6,
                    "items": [
                      {
                        "entryId": "25738213",
                        "name": "Panir Sabzi",
                        "description": "Panir or goat's cheese is an extremely delicious cheese, which the Persians habitually eat. If you walk down the avenue in Tehran during lunch hour, you will find the mason, and cobbler, the shopkeeper – everybody – eating bread and cheese. Very often Persians eat Panir with raw vegetables and herbs (radishes, basil, scallions, tarragon, or fresh mint) . It pleases the palate",
                        "prices": [
                          "4.50"
                        ],
                        "price": "4.50",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738220",
                        "name": "Mast-O Khiar",
                        "description": "Mast, known as yogurt in America, is used extensively in Persia. It is the food of the rich as well as the poor. It is said that Genghis Khan lived on it during his long marches through Mongolia and the Persian Empire when he couldn't obtain other food. This yogurt appetizer is served with diced cucumbers, chopped fresh dill and other herbs",
                        "prices": [
                          "4.50"
                        ],
                        "price": "4.50",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738228",
                        "name": "Mast-O Musir",
                        "description": "The Middle Easterners have known mast, now very popular in the western world as yogurt, for centuries. It is widely believed to contribute to long life and good health. The unique tart flavors of the yogurt and shallots make for a delicious dish",
                        "prices": [
                          "4.50"
                        ],
                        "price": "4.50",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738235",
                        "name": "Salad Shirazi",
                        "description": "There is an Old Persian saying that it takes four people to prepare a salad: A generous man to add the oil, a stingy man to add the vinegar, a wise man to give the right touch of salt and pepper, and a fool to mix it well. Diced cucumbers, tomatoes, and onions mixed with olive oil, lemon juice, and seasoning provides a pleasant combination to prepare you for your dining experience",
                        "prices": [
                          "4.50"
                        ],
                        "price": "4.50",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738242",
                        "name": "Torshi Bademjan",
                        "description": "The Persian homemaker takes pride in the quality and variety of the pickles kept in the pantry. This appetizer of eggplant, parsley, garlic, mint, cilantro, vinegar, salt, spices, and black caraway in uniquely Persian and extremely palatable",
                        "prices": [
                          "5.50"
                        ],
                        "price": "5.50",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738249",
                        "name": "Persian Salad Bowl",
                        "description": "Persians, likes most people, are fond of green salads and they try to eat them with every meal. Each homemaker has their own special touch and salad dressing. Shamshiry's has lettuce, cucumber, tomato, sliced black olives, kidney beans, and goat cheese",
                        "prices": [
                          "4.50"
                        ],
                        "price": "4.50",
                        "options": [],
                        "additions": []
                      }
                    ]
                  }
                },
                {
                  "sectionId": "s3492961",
                  "name": "Rice Dishes",
                  "description": "Vegetarian Rice Dishes With Any Entree: Add $3.50; Half rice, half salad: Add $1.95; Gorme Sabzi: $12.95; Geme: $12.95",
                  "entries": {
                    "count": 4,
                    "items": [
                      {
                        "entryId": "25738258",
                        "name": "Albalou Polo",
                        "description": "The preparation of polo is indeed an art and the Persians are considered the connoisseurs of this art. Persians consider polo as the essence of an exquisite dinner. This colorful and exotic dish is topped with syrupy sour cherries. It's particularly good when chicken is included",
                        "prices": [
                          "6.50"
                        ],
                        "price": "6.50",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738264",
                        "name": "Shirin Polo",
                        "description": "This is one of the most excitingly different, unusual, and demanding of the Persian rice dishes. But it is also one of the most rewarding. The sweet rice is seasoned with spices, perfumed with sugared orange peel, and made crunchy with pistachios and almonds. It tastes as if imaginative honeybees created it",
                        "prices": [
                          "6.50"
                        ],
                        "price": "6.50",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738271",
                        "name": "Baghali Polo",
                        "description": "This fragrant and devastatingly delicious dish is made with dill, a most delicate herb. Persians have favored dill for many years and use it in many dishes. One of the more famous and extremely tasteful dishes is Baghali Polo, where dill is used in combination with rice and soft good tasting fava beans. It's a treat you will want to share",
                        "prices": [
                          "6.50"
                        ],
                        "price": "6.50",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738277",
                        "name": "Zereshk Polo",
                        "description": "This exquisite dish will provide an exciting experience. The rice is studded with tart, dried red currants, giving it a wonderful sour taste explosion. The delightful and delectable taste will enchant and surprise you",
                        "prices": [
                          "6.50"
                        ],
                        "price": "6.50",
                        "options": [],
                        "additions": []
                      }
                    ]
                  }
                },
                {
                  "sectionId": "s3492966",
                  "name": "Meat",
                  "entries": {
                    "count": 7,
                    "items": [
                      {
                        "entryId": "25738285",
                        "name": "Chelo Kabob Kubideh*",
                        "description": "Kabob is the Persian word for meat or fowl cooked over a charcoal fire. There delicious strips of charcoal broiled ground meat are served with a snowy mound of rice topped with saffron. All the beef dishes achieve greatness when you add a raw egg yolk on the side, which you rapidly pour into the hot rice, continuing to toss it so that the egg coats all the grains as the heat cooks it. Stir in as much butter as you dare, and sprinkle in the brown powdered sumac that's in a shaker on the table. It's tart spiciness is irresistible",
                        "prices": [
                          "11.95"
                        ],
                        "price": "11.95",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738293",
                        "name": "Chelo Kabob Barg*",
                        "description": "The finest of all Kabobs is Kabob Barg. The secret of good Chelo Kabob is in the marinating of the meat. There is an Old Persian tradition as to how one should eat Chelo Kabob. The proper way of serving it is to put plenty of Chelo on a plate, make a small hole in the center of it, put the egg yolk in it, then plenty of butter, and sprinkle sumac over it. Mix well and start treating your self to the elegant taste of Filet Mignon. Fine food at its best",
                        "prices": [
                          "17.99"
                        ],
                        "price": "17.99",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738299",
                        "name": "Chelo Kabob Shamshiry",
                        "description": "Chelo Kabob is derived from two words: Chelo meaning cooked rice, and Kabob meaning open-flame broiled meat. The best Chelo Kabob was served at the Shamshiry restaurant in the Tehran bazaar. Whether it was the secret of the owner, nobody knows. But anybody who has tried this dish at the bazaar has never forgotten it. Now it's your chance to enjoy a combination of Chelo Kabob Kubideh and Chelo Kabob Barg. As it was prepared in Tehran, where Shamshiry was the hallmark for quality Kabob – The Best",
                        "prices": [
                          "19.99"
                        ],
                        "price": "19.99",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738307",
                        "name": "Chicken Soltani",
                        "description": "A combination of Chicken Kabob and Kubideh",
                        "prices": [
                          "16.99"
                        ],
                        "price": "16.99",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "134696020",
                        "name": "Lamb Sultani",
                        "prices": [
                          "19.99"
                        ],
                        "price": "19.99",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "134696021",
                        "name": "Lamb Shanks",
                        "description": "Served with Baghali Polo",
                        "prices": [
                          "15.95"
                        ],
                        "price": "15.95",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "134696022",
                        "name": "Rack of Lamb",
                        "prices": [
                          "19.95"
                        ],
                        "price": "19.95",
                        "options": [],
                        "additions": []
                      }
                    ]
                  }
                },
                {
                  "sectionId": "s3492971",
                  "name": "Poultry and Fish",
                  "entries": {
                    "count": 4,
                    "items": [
                      {
                        "entryId": "25738316",
                        "name": "Jujeh Kabob",
                        "description": "Cornish hen marinated in an original recipe, crisp edged and juicy is served in big chunks, on the bone, with rice. \"Wonderful\" is the way it has been described. Since rice is the daily food of the people of Persia, the Persian homemaker, through years of practice, has developed a special method of cooking the rice in order to preserve its entire natural flavor and produce a light and fluffy delicacy. Relish the experience",
                        "prices": [
                          "13.99"
                        ],
                        "price": "13.99",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738324",
                        "name": "Chicken Kabob",
                        "description": "Chicken kabob is made with breast meat that has been marinated in a special recipe. Persians serve chicken for the same occasions that Americans serve turkey. If the Persian homemaker has a guest, she will almost always serve some form of chicken. This is special. The chicken, served with rice in a snowy mound, will give your meal a whole new meaning",
                        "prices": [
                          "12.30"
                        ],
                        "price": "12.30",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738330",
                        "name": "Chicken Tandoori",
                        "description": "Big chunks of skewered breast meat that is moist, tender, and flavored with a fiery green herb paste. This method of cooking may have been developed from a civilization that thrived nearly four thousands years ago and Chicken Tandoori has become an international favorite over the years. The delectable and flavored rice that comes with the Chicken Tandoori will only add to your pleasure",
                        "prices": [
                          "12.99"
                        ],
                        "price": "12.99",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738338",
                        "name": "Mahi Kabob",
                        "description": "Fresh salmon bursting with juices, the grill having seared the surface so that the inside virtually steams. A mild fish that is pleasant in flavor and enjoyable to savor. The rice, which comes with the salmon, is tinted an intriguing greenish beige and seductively flavored by dill, and soft delicious fava beans. You'll fancy, love, and delight in this meal. Some say it's spectacular",
                        "prices": [
                          "17.99"
                        ],
                        "price": "17.99",
                        "options": [],
                        "additions": []
                      }
                    ]
                  }
                },
                {
                  "sectionId": "s3492978",
                  "name": "Desserts",
                  "entries": {
                    "count": 7,
                    "items": [
                      {
                        "entryId": "25738349",
                        "name": "Baklava",
                        "description": "Baklava is considered the grandest of all pastries. It is light, crisp and delicate. This pastry is present at every party and is served on every occasion. The small diamond shapes of buttery, crumbly dough filled with walnuts or pistachios and topped with rose water or honey is a delightful way to end a meal. The taste of baklava will please you",
                        "prices": [
                          "4.95"
                        ],
                        "price": "4.95",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738358",
                        "name": "Zolbia-Bamieh",
                        "description": "Zolbia is a sweet pretzel shaped fritter flavored with rose water syrup. It is firm, not quite crispy, but rather delicate. Bamieh is a saffron flavored pastry. Grooves are the distinctive design of this sweet",
                        "prices": [
                          "4.95"
                        ],
                        "price": "4.95",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738370",
                        "name": "Rollet",
                        "description": "A whipped cream roll. Very light",
                        "prices": [
                          "4.50"
                        ],
                        "price": "4.50",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738380",
                        "name": "Paludeh Shirazi",
                        "description": "Paludeh, a typical dessert, flavored with rose water is a combination of hair thin starch noodles and fruit syrup, topped with crushed ice. In Persia, Paludeh is served like ice cream. This simple and yet very exotic dessert will surprise you",
                        "prices": [
                          "5.50"
                        ],
                        "price": "5.50",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738387",
                        "name": "Persian Ice Cream",
                        "description": "Persian saffron ice cream, tinted a golden pink will remind you of midsummer. It is fragrant with rose water and as richly chewy as the most eggy creamy ice cream aspires to be. You can order it alone, or with Paludeh",
                        "prices": [
                          "6.00"
                        ],
                        "price": "6.00",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738394",
                        "name": "Mixed Persian Ice Cream and Paludeh",
                        "description": "Paludeh is a close relative of that hot weather, sidewalk treat, the snow cone. You can pour cherry syrup over the Paludeh with ice cream, or lemon juice if you're having it alone",
                        "prices": [
                          "6.95"
                        ],
                        "price": "6.95",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738401",
                        "name": "Cinnamon Ice Cream",
                        "description": "A rich, smooth, creamy, cinnamon flavored ice cream, one of our more popular desserts",
                        "prices": [
                          "4.50"
                        ],
                        "price": "4.50",
                        "options": [],
                        "additions": []
                      }
                    ]
                  }
                },
                {
                  "sectionId": "s3492987",
                  "name": "Beverages",
                  "entries": {
                    "count": 5,
                    "items": [
                      {
                        "entryId": "25738412",
                        "name": "Pot of Persian Tea (One Person)",
                        "description": "Tea is the national drink of Persia and as soon as visitors step over the threshold, a small glass of tea with three lumps of sugar and a teaspoon are handed to them. Persians serve tea in a glass in order to be able to appreciate its color. The color and fragrance of the tea is very important to Persians since they believe the pleasures of sight and smell come before that of taste. It is always served very hot",
                        "prices": [
                          "2.75"
                        ],
                        "price": "2.75",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738418",
                        "name": "Iced Tea",
                        "description": "Complimentary refills",
                        "prices": [
                          "2.75"
                        ],
                        "price": "2.75",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738425",
                        "name": "Coffee",
                        "description": "Complimentary refills",
                        "prices": [
                          "2.75"
                        ],
                        "price": "2.75",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738431",
                        "name": "Soft Drinks",
                        "description": "Coke, Diet Coke, Sprite, Lemonade",
                        "prices": [
                          "2.95"
                        ],
                        "price": "2.95",
                        "options": [],
                        "additions": []
                      },
                      {
                        "entryId": "25738453",
                        "name": "Doogh",
                        "description": "This delightfully refreshing yogurt drink is very popular in Persia. It is always on hand at home to serve to family and guests. Vendors who sell Doogh on street corners are familiar sights. Very often they advertise their products with a poem or two from Omar Khayyam and replace Omar's \"jug of wine\" with a \"jug of Doogh",
                        "prices": [
                          "2.75"
                        ],
                        "price": "2.75",
                        "options": [],
                        "additions": []
                      }
                    ]
                  }
                }
              ]
            }
          }
        ]
      }
    }
  }
}